Обработки/Reports/_ЖурналПорученийОтКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ЖурналПорученийОтКлиентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ЖурналПорученийОтКлиентов/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация 	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период  		= ТекущаяДата();
	
	Отчет.РежимОтбора = 2;
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не РаботаСОтчетамиКлиентСервер.ПроверитьНастройкиПодписантаОтчета(Отчет, Подписант, Отчет.Организация)
		Или Не ЗначениеЗаполнено(Подписант) Тогда
		РаботаСОтчетамиКлиентСервер.ЗаполнитьПодписанта(ЭтаФорма, Отчет.Организация); 		
	КонецЕсли;
				
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
		
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантОтчетаНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
		
	РаботаСОтчетамиКлиент.ПодписантОтчетаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение);
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)        	
	
	РаботаСОтчетамиКлиент.ПодписантПриИзменении(Подписант, Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхКонтактногоЛица);
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)

	НастроитьВидимостьИДоступность(ЭтаФорма);
	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДеятельностиПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(ЭтаФорма)

	Элементы 		= ЭтаФорма.Элементы;		
	ДанныеОбъекта	= ЭтаФорма.Отчет;
	
	Элементы.СчетДоверительногоУправления.Видимость	= (ДанныеОбъекта.РежимОтбора = 1);
	Элементы.ВидДеятельности.Видимость				= (ДанныеОбъекта.РежимОтбора = 2);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииПараметровОтчета(ЭтаФорма)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат, "НеАктуальность");		
	
КонецПроцедуры

#КонецОбласти
